1/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.75e-3;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.01;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    walls
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    front 
    {
        type            empty;
    }

    back 
    {
        type            empty;
    }

    ACMI1_blockage
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    ACMI2_blockage
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    ACMI1_couple
    {
        type            cyclicACMI;
        value           $internalField;
    }

    ACMI2_couple
    {
        type            cyclicACMI;
        value           $internalField;
    }
}


// ************************************************************************* //
